case2D/0/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 298.15;

boundaryField
{
    ".*Empty"
    {
        type            empty;
    }

    roomWall
    {
        type            zeroGradient;
    }

//     baffleWall
//     {
//         type            zeroGradient;
//     }

    cabinetWall
    {
        type            fixedValue;
        value           uniform 313.15; // 40 degC
    }

    inlet
    {
        type            fixedValue;
	    value 		    uniform 298.15;
    }

    outlet
    {
        type            zeroGradient;
    }

}

// ************************************************************************* //
